benchmark/results/20260919-214849/adaptive-tiny-w4.txt
Running 10s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.86ms  405.22us  10.17ms   91.04%
    Req/Sec    19.78k     1.04k   21.34k    76.00%
  Latency Distribution
     50%  774.00us
     75%    0.88ms
     90%    1.06ms
     99%    2.48ms
  393540 requests in 10.01s, 78.15MB read
  Non-2xx or 3xx responses: 373648
Requests/sec:  39304.44
Transfer/sec:      7.81MB