benchmark/results/20260919-214849/baseline-w4.txt
Running 10s test @ http://127.0.0.1:8080/work
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.51ms  564.93us  15.42ms   82.42%
    Req/Sec    17.82k   709.64    19.14k    81.00%
  Latency Distribution
     50%    1.58ms
     75%    1.76ms
     90%    1.94ms
     99%    2.41ms
  354792 requests in 10.01s, 59.21MB read
Requests/sec:  35441.70
Transfer/sec:      5.91MB